DELETE FROM user_roles;
DELETE FROM meals;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO meals (user_id, date_time, description, calories)
VALUES (100000, '2021-06-18 10:00:00', 'Завтрак Юзера', 1),
       (100000, '2021-06-18 15:00:00', 'Обед Юзера', 1),
       (100000, '2021-06-18 20:00:00', 'Ужин Юзера', 1),
       (100000, '2021-06-19 10:00:00', 'Завтрак Юзера', 700),
       (100000, '2021-06-19 15:00:00', 'Обед Юзера', 700),
       (100000, '2021-06-19 20:00:00', 'Ужин Юзера', 700),
       (100001, '2021-06-18 10:00:00', 'Завтрак Админа', 1000),
       (100001, '2021-06-18 15:00:00', 'Обед Админа', 1000),
       (100001, '2021-06-18 20:00:00', 'Ужин Админа', 1000),
       (100001, '2021-06-19 10:00:00', 'Завтрак Админа', 200),
       (100001, '2021-06-19 15:00:00', 'Обед Админа', 200),
       (100001, '2021-06-19 20:00:00', 'Ужин Админа', 200);

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);
